In [1]:
# pandasが使えるようにインポート
import pandas as pd

In [2]:
# pandasでデータフレームの作成
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]])
df.columns=['col01', 'col02', 'col03']
df.index=['idx01','idx02','idx03']
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [3]:
df.loc['idx01'] # 行名や列名を指定して、行や列を取得

col01    1
col02    2
col03    3
Name: idx01, dtype: int64

In [4]:
df.loc['idx01','col02'] # 行、列を指定して取得。リストで行→列の順

2

In [5]:
df.loc[:,'col01'] # 列すべての取得

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [6]:
df.iloc[:,0] # ilocを使用して行の番号や列の番号を指定して、行や列を取得する。

idx01    1
idx02    4
idx03    7
Name: col01, dtype: int64

In [7]:
# pandasでデータフレームの作成
df = pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],
                    columns=['col01', 'col02', 'col03'],
                    index=['idx01','idx02','idx03'])
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7      8      9

In [8]:
# 行、列を指定して取得。リストで行→列の順
df.loc['idx03', 'col02']

8

In [9]:
# 行、列を指定して,置き換える
df.loc['idx03', 'col02']=100
df

       col01  col02  col03
idx01      1      2      3
idx02      4      5      6
idx03      7    100      9

In [10]:
# 一度に複数のデータを変更
df.loc[:, 'col03'] = ['Tokyo','Osaka','Hokkaido']
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7    100  Hokkaido

In [11]:
# スライスを使用して２列目から３列目を表示
df.loc[:, 'col02':'col03']

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [12]:
# ilocを使用して２列目から３列目を表示
df.iloc[:,1:3]

       col02     col03
idx01      2     Tokyo
idx02      5     Osaka
idx03    100  Hokkaido

In [16]:
# get_locを使用して行番号を取得
df.index.get_loc('idx03')

2

In [15]:
# get_locを使用して列番号を取得
df.columns.get_loc('col02')

1

In [17]:
# get_locで指定してデータの変更
df.iloc[df.index.get_loc('idx03'),df.columns.get_loc('col02')]=1000
df

       col01  col02     col03
idx01      1      2     Tokyo
idx02      4      5     Osaka
idx03      7   1000  Hokkaido

In [18]:
df.dtypes # データ型を調べる

col01     int64
col02     int64
col03    object
dtype: object

In [19]:
df.shape # 行数・列数を取得

(3, 3)

In [20]:
df.T # 行と列を入れ替える

       idx01  idx02     idx03
col01      1      4         7
col02      2      5      1000
col03  Tokyo  Osaka  Hokkaido